{
  "job-title": "Ingeniero de Integración de Sistemas",
  "nav-summary": "Resumen",
  "nav-skills": "Habilidades Técnicas",
  "nav-certifications": "Certificaciones Profesionales",
  "nav-experience": "Historial Laboral",
  "nav-projects": "Proyectos Destacados",
  "nav-education": "Educación",
  "nav-open-source": "Proyectos de Código Abierto",
  "summary-heading": "Resumen",
  "summary-text": "Ingeniero de Integración de Sistemas con más de 9 años desarrollando sistemas distribuidos a escala empresarial para infraestructura crítica. Historial comprobado liderando equipos multifuncionales de más de 15 ingenieros en migraciones de sistemas complejos, desarrollo de aplicaciones personalizadas, arquitectura de bases de datos y sistemas de procesamiento en tiempo real. Experto en C#, Python y prácticas modernas de DevOps.",
  "skills-heading": "Habilidades Técnicas",
  "leadership-heading": "Liderazgo y Gestión",
  "certifications-heading": "Certificaciones Profesionales",
  "experience-heading": "Historial Laboral",
  "projects-heading": "Proyectos Destacados",
  "education-heading": "Educación",
  "open-source-heading": "Proyectos de Código Abierto",
  
  "skill-architecture": "Arquitectura y Sistemas",
  "skill-programming": "Lenguajes de Programación",
  "skill-cloud": "Cloud y DevOps",
  "skill-ai": "IA y Herramientas de Productividad",
  "skill-integration": "Integración de Sistemas",
  "skill-data": "Ingeniería de Datos",
  
  "cert-peng-title": "Ingeniero Profesional (P.Eng.)",
  "cert-peng-org": "APEGA - Asociación de Ingenieros Profesionales y Geocientíficos de Alberta",
  "cert-peng-license": "Número de Licencia:",
  "cert-peng-date": "Fecha de Obtención:",
  "cert-peng-status": "Estado:",
  "cert-peng-active": "Activo (renovado anualmente)",
  "cert-peng-desc": "Autorizado para ejercer la ingeniería en Alberta, demostrando competencia técnica, responsabilidad profesional y adhesión a las normas y ética de la ingeniería.",
  "cert-pmp-title": "Profesional en Gestión de Proyectos (PMP)",
  "cert-pmp-org": "Project Management Institute (PMI)",
  "cert-pmp-id": "ID de Credencial:",
  "cert-pmp-expiration": "Expiración:",
  "cert-pmp-desc": "Certificación reconocida mundialmente que valida la experiencia en metodología de gestión de proyectos, liderazgo y prácticas de gestión empresarial estratégica.",
  
  "cert-peng-date-value": "29 de junio de 2022",
  "cert-pmp-date-value": "7 de marzo de 2025",
  "cert-pmp-expiration-value": "6 de marzo de 2028",
  
  "job1-title": "Ingeniero de Sistemas Senior y Líder de Equipo Técnico",
  "job1-company": "Dexcent Inc. | Calgary, AB | Noviembre 2022 – Actual",
  "job2-title": "Desarrollador de UI y Base de Datos",
  "job2-company": "TRC Solutions | Calgary, AB | Septiembre 2021 – Noviembre 2022",
  "job3-title": "Ingeniero de Software → Ingeniero Principal",
  "job3-company": "AVEVA (anteriormente Schneider Electric) | Calgary, AB | 2015 – 2021",
  
  "project1-title": "Modernización Empresarial Colonial (2022-Presente)",
  "project1-desc": "Líder Técnico de Programa para modernización integral de software empresarial involucrando más de 15 ingenieros a través de múltiples flujos de trabajo. Responsable de decisiones de arquitectura técnica, estrategia de integración de sistemas y desarrollo de aplicaciones personalizadas.",
  "project2-title": "Pipeline TC Energy US East (2023-2025)",
  "project2-desc": "Inicialmente desarrollador UI responsable de implementar estándares de interfaz modernos y herramientas de migración automatizadas para miles de interfaces legadas. Promovido a Líder de Desarrollo gestionando un equipo de 5 desarrolladores.",
  
  "edu-degree": "Licenciatura en Ciencias en Ingeniería de Sistemas",
  "edu-school": "Universidad de Alberta | Edmonton | 2010 - 2014",
  
  "leadership-1": "Gestión de Programas - Liderando programas de modernización SCADA de varios millones de dólares",
  "leadership-2": "Liderazgo Técnico - Experiencia en arquitectura de sistemas e integración para infraestructura crítica",
  "leadership-3": "Gestión de Equipos Multifuncionales - Supervisando más de 15 ingenieros a través de múltiples flujos de trabajo (HMI, Aplicaciones Personalizadas, Sistemas de Gestión de Líquidos)",
  "leadership-4": "Gestión de Stakeholders - Interfaz con ejecutivos y tomadores de decisiones de grandes empresas de tuberías",
  "leadership-5": "Gestión de Recursos - Asignación de equipos, programación y planificación de capacidad",
  "leadership-6": "Gestión del Cambio - Desarrollo de órdenes de cambio y gestión de alcance",
  "leadership-7": "Resolución de Conflictos - Resolución de disputas técnicas e interpersonales",
  "leadership-8": "Toma de Decisiones Estratégicas - Guiando decisiones de arquitectura técnica e implementación",
  "leadership-9": "Asesoría al Cliente - Proporcionando consultoría experta en desafíos complejos de integración de sistemas",
  "leadership-10": "Estimación de Proyectos - Análisis de alcance y estimación de esfuerzo para sistemas empresariales",
  "leadership-11": "Arquitectura de Soluciones - Desarrollo de documentos de diseño para sistemas de infraestructura crítica",
  "leadership-12": "Gestión de Riesgos - Identificación y mitigación de riesgos técnicos y de proyecto",
  
  "job1-bullet1": "Líder Técnico de Programa para modernización de software empresarial, supervisando más de 15 ingenieros a través de múltiples flujos de desarrollo (UI, base de datos, aplicaciones personalizadas)",
  "job1-bullet2": "Arquitecta e implementa pipelines de despliegue automatizados y sistemas de gestión de cambios usando PowerShell, Git y Azure DevOps",
  "job1-bullet3": "Lidera migraciones complejas de bases de datos involucrando conjuntos de datos multi-terabyte con requisitos de tiempo de inactividad cero",
  "job2-bullet1": "Lideró el desarrollo de aplicaciones full-stack y soluciones de base de datos para sistemas de infraestructura crítica bajo requisitos de cumplimiento federal",
  "job2-bullet2": "Desarrolló procesos de control de calidad y automatización de despliegue, contribuyendo a la finalización de proyecto más rápida en la historia de la empresa",
  "job3-bullet1": "Progresó de desarrollador junior a líder técnico en 6 años, gestionando despliegues de sistemas empresariales para grandes empresas energéticas",
  "job3-bullet2": "Desarrolló aplicaciones de software personalizadas y soluciones de base de datos especializadas en procesamiento de datos en tiempo real y computación estadística",

  "badge-distributed-systems": "Sistemas Distribuidos",
  "badge-microservices": "Microservicios",
  "badge-event-driven": "Arquitectura Orientada a Eventos",
  "badge-realtime-processing": "Procesamiento en Tiempo Real",
  "badge-csharp": "C# (.NET)",
  "badge-typescript": "TypeScript",
  "badge-python": "Python",
  "badge-sql": "SQL",
  "badge-javascript": "JavaScript",
  "badge-nodejs": "Node.js",
  "badge-cpp": "C++",
  "badge-azure": "Azure",
  "badge-aws": "AWS",
  "badge-docker": "Docker/Podman",
  "badge-cicd": "Pipelines CI/CD",
  "badge-jenkins": "Jenkins",
  "badge-git": "Git",
  "badge-claude": "Claude Pro",
  "badge-llm": "LLM Local (Ollama)",
  "badge-ai-dev": "Desarrollo Asistido por IA",
  "badge-doc-automation": "Automatización de Documentos",
  "badge-ragflow": "RAGFlow",
  "badge-enterprise-apis": "APIs Empresariales",
  "badge-opc": "Protocolos Industriales (OPC)",
  "badge-realtime-arch": "Arquitecturas en Tiempo Real",
  "badge-multiterabyte": "Bases de Datos Multi-terabyte",
  "badge-etl": "Pipelines ETL",
  "badge-sql-server": "SQL Server"
}